#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization `success`
#### Terraform Plan `success`
#### Terraform Validation `success`

<details><summary>Show Plan</summary>
```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_app_service.sst_app_service will be created
  + resource "azurerm_app_service" "sst_app_service" {
      + app_service_plan_id               = (known after apply)
      + app_settings                      = (known after apply)
      + client_affinity_enabled           = false
      + client_cert_enabled               = false
      + client_cert_mode                  = (known after apply)
      + custom_domain_verification_id     = (known after apply)
      + default_site_hostname             = (known after apply)
      + enabled                           = true
      + https_only                        = false
      + id                                = (known after apply)
      + key_vault_reference_identity_id   = (known after apply)
      + location                          = "westeurope"
      + name                              = "was-sst-dev-001"
      + outbound_ip_address_list          = (known after apply)
      + outbound_ip_addresses             = (known after apply)
      + possible_outbound_ip_address_list = (known after apply)
      + possible_outbound_ip_addresses    = (known after apply)
      + resource_group_name               = "rg-sst-dev"
      + site_credential                   = (known after apply)
      + tags                              = {
          + "ActivityType" = "Demo"
          + "Client"       = "Microsoft"
          + "ProjectName"  = "ACS"
        }

      + auth_settings {
          + additional_login_params        = (known after apply)
          + allowed_external_redirect_urls = (known after apply)
          + default_provider               = (known after apply)
          + enabled                        = (known after apply)
          + issuer                         = (known after apply)
          + runtime_version                = (known after apply)
          + token_refresh_extension_hours  = (known after apply)
          + token_store_enabled            = (known after apply)
          + unauthenticated_client_action  = (known after apply)

          + active_directory {
              + allowed_audiences = (known after apply)
              + client_id         = (known after apply)
              + client_secret     = (sensitive value)
            }

          + facebook {
              + app_id       = (known after apply)
              + app_secret   = (sensitive value)
              + oauth_scopes = (known after apply)
            }

          + google {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + microsoft {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + twitter {
              + consumer_key    = (known after apply)
              + consumer_secret = (sensitive value)
            }
        }

      + connection_string {
          + name  = (known after apply)
          + type  = (known after apply)
          + value = (sensitive value)
        }

      + logs {
          + detailed_error_messages_enabled = (known after apply)
          + failed_request_tracing_enabled  = (known after apply)

          + application_logs {
              + file_system_level = (known after apply)

              + azure_blob_storage {
                  + level             = (known after apply)
                  + retention_in_days = (known after apply)
                  + sas_url           = (sensitive value)
                }
            }

          + http_logs {
              + azure_blob_storage {
                  + retention_in_days = (known after apply)
                  + sas_url           = (sensitive value)
                }

              + file_system {
                  + retention_in_days = (known after apply)
                  + retention_in_mb   = (known after apply)
                }
            }
        }

      + site_config {
          + acr_use_managed_identity_credentials = (known after apply)
          + acr_user_managed_identity_client_id  = (known after apply)
          + always_on                            = (known after apply)
          + app_command_line                     = (known after apply)
          + auto_swap_slot_name                  = (known after apply)
          + default_documents                    = (known after apply)
          + dotnet_framework_version             = (known after apply)
          + ftps_state                           = (known after apply)
          + health_check_path                    = (known after apply)
          + http2_enabled                        = (known after apply)
          + ip_restriction                       = (known after apply)
          + java_container                       = (known after apply)
          + java_container_version               = (known after apply)
          + java_version                         = (known after apply)
          + linux_fx_version                     = (known after apply)
          + local_mysql_enabled                  = (known after apply)
          + managed_pipeline_mode                = (known after apply)
          + min_tls_version                      = (known after apply)
          + number_of_workers                    = (known after apply)
          + php_version                          = (known after apply)
          + python_version                       = (known after apply)
          + remote_debugging_enabled             = (known after apply)
          + remote_debugging_version             = (known after apply)
          + scm_ip_restriction                   = (known after apply)
          + scm_type                             = (known after apply)
          + scm_use_main_ip_restriction          = (known after apply)
          + use_32_bit_worker_process            = (known after apply)
          + vnet_route_all_enabled               = (known after apply)
          + websockets_enabled                   = (known after apply)
          + windows_fx_version                   = (known after apply)

          + cors {
              + allowed_origins     = (known after apply)
              + support_credentials = (known after apply)
            }
        }

      + source_control {
          + branch             = (known after apply)
          + manual_integration = (known after apply)
          + repo_url           = (known after apply)
          + rollback_enabled   = (known after apply)
          + use_mercurial      = (known after apply)
        }

      + storage_account {
          + access_key   = (sensitive value)
          + account_name = (known after apply)
          + mount_path   = (known after apply)
          + name         = (known after apply)
          + share_name   = (known after apply)
          + type         = (known after apply)
        }
    }

  # azurerm_application_insights.sst_appinsights will be created
  + resource "azurerm_application_insights" "sst_appinsights" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "westeurope"
      + name                                  = "ai-sst-dev-001"
      + resource_group_name                   = "rg-sst-dev"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + tags                                  = {
          + "ActivityType" = "Demo"
          + "Client"       = "Microsoft"
          + "ProjectName"  = "ACS"
        }
    }

  # azurerm_network_security_group.sst_network will be created
  + resource "azurerm_network_security_group" "sst_network" {
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "nsg-sst-dev-001"
      + resource_group_name = "rg-sst-dev"
      + security_rule       = (known after apply)
    }

  # azurerm_resource_group.sst_resource_group will be created
  + resource "azurerm_resource_group" "sst_resource_group" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "rg-sst-dev"
      + tags     = {
          + "ActivityType" = "Demo"
          + "Client"       = "Microsoft"
          + "ProjectName"  = "ACS"
        }
    }

  # azurerm_service_plan.sst_app_service_plan will be created
  + resource "azurerm_service_plan" "sst_app_service_plan" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "westeurope"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "asp-sst-dev-001"
      + os_type                      = "Linux"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "rg-sst-dev"
      + sku_name                     = "P1v2"
      + tags                         = {
          + "ActivityType" = "Demo"
          + "Client"       = "Microsoft"
          + "ProjectName"  = "ACS"
        }
      + worker_count                 = (known after apply)
    }

  # azurerm_virtual_network.example will be created
  + resource "azurerm_virtual_network" "example" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = [
          + "10.0.0.4",
          + "10.0.0.5",
        ]
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "net-sst-dev-001"
      + resource_group_name = "rg-sst-dev"
      + subnet              = [
          + {
              + address_prefix = "10.0.1.0/24"
              + id             = (known after apply)
              + name           = "management"
              + security_group = ""
            },
          + {
              + address_prefix = "10.0.2.0/24"
              + id             = (known after apply)
              + name           = "security"
              + security_group = (known after apply)
            },
        ]
      + tags                = {
          + "ActivityType" = "Demo"
          + "Client"       = "Microsoft"
          + "ProjectName"  = "ACS"
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Warning: Deprecated Resource

  with azurerm_app_service.sst_app_service,
  on main.tf line 25, in resource "azurerm_app_service" "sst_app_service":
  25: resource "azurerm_app_service" "sst_app_service" {  

The `azurerm_app_service` resource has been superseded by the
`azurerm_linux_web_app` and `azurerm_windows_web_app` resources. Whilst this
resource will continue to be available in the 2.x and 3.x releases it is
feature-frozen for compatibility purposes, will no longer receive any updates
and will be removed in a future major release of the Azure Provider.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: deploy_plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "deploy_plan.tfplan"

```
</details>
*Pusher: @GTConnor, Action: `pull_request`*